#+TITLE: x86 体系结构及系统启动
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2023-10-23 Mon 13:26:59>
#+STARTUP: overview num indent

** 中断，陷阱和系统调用
中断(Interrupt) 是指 CPU 停下当前的工作任务，去处理其他事情，处理完后回来继续执
行刚才的任务 [[https://stanislavs.org/helppc/idx_interrupt.html][Interrupt Services]] , 中断是硬件实现的基础功能
#+BEGIN_SRC asm
  int 0x80 # 中断号
#+END_SRC

BIOS 提供一下中断，[[https://stanislavs.org/helppc/idx_interrupt.html][link]]
| 功能码 | 说明                   |
|--------+------------------------|
|   0x13 | 读取磁盘数据           |
|   0x14 | 异步通信: 串口输出字符 |
|   0x16 | 读取键盘输入           |
|   0x1a | 时钟中断               |

陷阱(Trap)：是一种有意的，预先安排的异常事件
1. 一般是在编写程序时故意设下的陷阱指令，而后执行到陷阱指令后，CPU 将会调用特定
   程序进行相应的处理，处理结束后返回到陷阱指令的下一条指令
2. 如系统调用，程序调试功能等, 最常见的就是 Linux 系统调用的实现，使用中断指令

系统调用(System Call) 指操作系统提供给应用的一组 API 函数， Linux 系统调用见

查看 32 位操作系统系统调用号 NR_syscal 文件见
#+BEGIN_EXAMPLE
  /usr/src/linux-headers-5.15.0-87-generic » rg NR_write
  arch/x86/include/generated/uapi/asm/unistd_64.h
  5:#define __NR_write 1
  24:#define __NR_writev 20

  arch/x86/include/generated/uapi/asm/unistd_32.h
  8:#define __NR_write 4
  150:#define __NR_writev 146

  arch/x86/include/generated/uapi/asm/unistd_x32.h
  5:#define __NR_write (__X32_SYSCALL_BIT + 1)
  321:#define __NR_writev (__X32_SYSCALL_BIT + 516)
#+END_EXAMPLE

[[file:lab/05-interrupt/greet.S]]

通过 strace 查看系统调用过程
#+BEGIN_SRC sh :results output :exports both
  strace ./lab/05-interrupt/greet.out 2>&1 1>/dev/null
#+END_SRC

#+RESULTS:
: execve("./lab/05-interrupt/greet.out", ["./lab/05-interrupt/greet.out"], 0x7ffcb604f8b0 /* 56 vars */) = 0
: [ Process PID=82486 runs in 32 bit mode. ]
: write(1, "Hello from ASM!\n", 16)       = 16
: exit(0)                                 = ?
: +++ exited with 0 +++

** 系统引导及分段
#+BEGIN_SRC sh :results output :exports both
  objdump -d ./lab/05-interrupt/greet2.run
#+END_SRC

#+RESULTS:
#+begin_example

  ./lab/05-interrupt/greet2.run:     file format elf32-i386


  Disassembly of section .init:

  00001000 <_init>:
      1000:	f3 0f 1e fb             endbr32
      1004:	53                      push   %ebx
      1005:	83 ec 08                sub    $0x8,%esp
      1008:	e8 93 00 00 00          call   10a0 <__x86.get_pc_thunk.bx>
      100d:	81 c3 cb 2f 00 00       add    $0x2fcb,%ebx
      1013:	8b 83 1c 00 00 00       mov    0x1c(%ebx),%eax
      1019:	85 c0                   test   %eax,%eax
      101b:	74 02                   je     101f <_init+0x1f>
      101d:	ff d0                   call   *%eax
      101f:	83 c4 08                add    $0x8,%esp
      1022:	5b                      pop    %ebx
      1023:	c3                      ret

  Disassembly of section .plt:

  00001030 <__libc_start_main@plt-0x10>:
      1030:	ff b3 04 00 00 00       push   0x4(%ebx)
      1036:	ff a3 08 00 00 00       jmp    *0x8(%ebx)
      103c:	00 00                   add    %al,(%eax)
          ...

  00001040 <__libc_start_main@plt>:
      1040:	ff a3 0c 00 00 00       jmp    *0xc(%ebx)
      1046:	68 00 00 00 00          push   $0x0
      104b:	e9 e0 ff ff ff          jmp    1030 <_init+0x30>

  00001050 <write@plt>:
      1050:	ff a3 10 00 00 00       jmp    *0x10(%ebx)
      1056:	68 08 00 00 00          push   $0x8
      105b:	e9 d0 ff ff ff          jmp    1030 <_init+0x30>

  Disassembly of section .plt.got:

  00001060 <__cxa_finalize@plt>:
      1060:	ff a3 18 00 00 00       jmp    *0x18(%ebx)
      1066:	66 90                   xchg   %ax,%ax

  Disassembly of section .text:

  00001070 <_start>:
      1070:	f3 0f 1e fb             endbr32
      1074:	31 ed                   xor    %ebp,%ebp
      1076:	5e                      pop    %esi
      1077:	89 e1                   mov    %esp,%ecx
      1079:	83 e4 f0                and    $0xfffffff0,%esp
      107c:	50                      push   %eax
      107d:	54                      push   %esp
      107e:	52                      push   %edx
      107f:	e8 18 00 00 00          call   109c <_start+0x2c>
      1084:	81 c3 54 2f 00 00       add    $0x2f54,%ebx
      108a:	6a 00                   push   $0x0
      108c:	6a 00                   push   $0x0
      108e:	51                      push   %ecx
      108f:	56                      push   %esi
      1090:	ff b3 20 00 00 00       push   0x20(%ebx)
      1096:	e8 a5 ff ff ff          call   1040 <__libc_start_main@plt>
      109b:	f4                      hlt
      109c:	8b 1c 24                mov    (%esp),%ebx
      109f:	c3                      ret

  000010a0 <__x86.get_pc_thunk.bx>:
      10a0:	8b 1c 24                mov    (%esp),%ebx
      10a3:	c3                      ret
      10a4:	66 90                   xchg   %ax,%ax
      10a6:	66 90                   xchg   %ax,%ax
      10a8:	66 90                   xchg   %ax,%ax
      10aa:	66 90                   xchg   %ax,%ax
      10ac:	66 90                   xchg   %ax,%ax
      10ae:	66 90                   xchg   %ax,%ax

  000010b0 <deregister_tm_clones>:
      10b0:	e8 e4 00 00 00          call   1199 <__x86.get_pc_thunk.dx>
      10b5:	81 c2 23 2f 00 00       add    $0x2f23,%edx
      10bb:	8d 8a 40 00 00 00       lea    0x40(%edx),%ecx
      10c1:	8d 82 40 00 00 00       lea    0x40(%edx),%eax
      10c7:	39 c8                   cmp    %ecx,%eax
      10c9:	74 1d                   je     10e8 <deregister_tm_clones+0x38>
      10cb:	8b 82 14 00 00 00       mov    0x14(%edx),%eax
      10d1:	85 c0                   test   %eax,%eax
      10d3:	74 13                   je     10e8 <deregister_tm_clones+0x38>
      10d5:	55                      push   %ebp
      10d6:	89 e5                   mov    %esp,%ebp
      10d8:	83 ec 14                sub    $0x14,%esp
      10db:	51                      push   %ecx
      10dc:	ff d0                   call   *%eax
      10de:	83 c4 10                add    $0x10,%esp
      10e1:	c9                      leave
      10e2:	c3                      ret
      10e3:	8d 74 26 00             lea    0x0(%esi,%eiz,1),%esi
      10e7:	90                      nop
      10e8:	c3                      ret
      10e9:	8d b4 26 00 00 00 00    lea    0x0(%esi,%eiz,1),%esi

  000010f0 <register_tm_clones>:
      10f0:	e8 a4 00 00 00          call   1199 <__x86.get_pc_thunk.dx>
      10f5:	81 c2 e3 2e 00 00       add    $0x2ee3,%edx
      10fb:	55                      push   %ebp
      10fc:	89 e5                   mov    %esp,%ebp
      10fe:	53                      push   %ebx
      10ff:	8d 8a 40 00 00 00       lea    0x40(%edx),%ecx
      1105:	8d 82 40 00 00 00       lea    0x40(%edx),%eax
      110b:	83 ec 04                sub    $0x4,%esp
      110e:	29 c8                   sub    %ecx,%eax
      1110:	89 c3                   mov    %eax,%ebx
      1112:	c1 e8 1f                shr    $0x1f,%eax
      1115:	c1 fb 02                sar    $0x2,%ebx
      1118:	01 d8                   add    %ebx,%eax
      111a:	d1 f8                   sar    %eax
      111c:	74 14                   je     1132 <register_tm_clones+0x42>
      111e:	8b 92 24 00 00 00       mov    0x24(%edx),%edx
      1124:	85 d2                   test   %edx,%edx
      1126:	74 0a                   je     1132 <register_tm_clones+0x42>
      1128:	83 ec 08                sub    $0x8,%esp
      112b:	50                      push   %eax
      112c:	51                      push   %ecx
      112d:	ff d2                   call   *%edx
      112f:	83 c4 10                add    $0x10,%esp
      1132:	8b 5d fc                mov    -0x4(%ebp),%ebx
      1135:	c9                      leave
      1136:	c3                      ret
      1137:	8d b4 26 00 00 00 00    lea    0x0(%esi,%eiz,1),%esi
      113e:	66 90                   xchg   %ax,%ax

  00001140 <__do_global_dtors_aux>:
      1140:	f3 0f 1e fb             endbr32
      1144:	55                      push   %ebp
      1145:	89 e5                   mov    %esp,%ebp
      1147:	53                      push   %ebx
      1148:	e8 53 ff ff ff          call   10a0 <__x86.get_pc_thunk.bx>
      114d:	81 c3 8b 2e 00 00       add    $0x2e8b,%ebx
      1153:	83 ec 04                sub    $0x4,%esp
      1156:	80 bb 3e 00 00 00 00    cmpb   $0x0,0x3e(%ebx)
      115d:	75 27                   jne    1186 <__do_global_dtors_aux+0x46>
      115f:	8b 83 18 00 00 00       mov    0x18(%ebx),%eax
      1165:	85 c0                   test   %eax,%eax
      1167:	74 11                   je     117a <__do_global_dtors_aux+0x3a>
      1169:	83 ec 0c                sub    $0xc,%esp
      116c:	ff b3 2c 00 00 00       push   0x2c(%ebx)
      1172:	e8 e9 fe ff ff          call   1060 <__cxa_finalize@plt>
      1177:	83 c4 10                add    $0x10,%esp
      117a:	e8 31 ff ff ff          call   10b0 <deregister_tm_clones>
      117f:	c6 83 3e 00 00 00 01    movb   $0x1,0x3e(%ebx)
      1186:	8b 5d fc                mov    -0x4(%ebp),%ebx
      1189:	c9                      leave
      118a:	c3                      ret
      118b:	8d 74 26 00             lea    0x0(%esi,%eiz,1),%esi
      118f:	90                      nop

  00001190 <frame_dummy>:
      1190:	f3 0f 1e fb             endbr32
      1194:	e9 57 ff ff ff          jmp    10f0 <register_tm_clones>

  00001199 <__x86.get_pc_thunk.dx>:
      1199:	8b 14 24                mov    (%esp),%edx
      119c:	c3                      ret

  0000119d <main>:
      119d:	8d 4c 24 04             lea    0x4(%esp),%ecx
      11a1:	83 e4 f0                and    $0xfffffff0,%esp
      11a4:	ff 71 fc                push   -0x4(%ecx)
      11a7:	55                      push   %ebp
      11a8:	89 e5                   mov    %esp,%ebp
      11aa:	53                      push   %ebx
      11ab:	51                      push   %ecx
      11ac:	e8 2c 00 00 00          call   11dd <__x86.get_pc_thunk.ax>
      11b1:	05 27 2e 00 00          add    $0x2e27,%eax
      11b6:	83 ec 04                sub    $0x4,%esp
      11b9:	6a 0d                   push   $0xd
      11bb:	8d 90 30 00 00 00       lea    0x30(%eax),%edx
      11c1:	52                      push   %edx
      11c2:	6a 01                   push   $0x1
      11c4:	89 c3                   mov    %eax,%ebx
      11c6:	e8 85 fe ff ff          call   1050 <write@plt>
      11cb:	83 c4 10                add    $0x10,%esp
      11ce:	b8 00 00 00 00          mov    $0x0,%eax
      11d3:	8d 65 f8                lea    -0x8(%ebp),%esp
      11d6:	59                      pop    %ecx
      11d7:	5b                      pop    %ebx
      11d8:	5d                      pop    %ebp
      11d9:	8d 61 fc                lea    -0x4(%ecx),%esp
      11dc:	c3                      ret

  000011dd <__x86.get_pc_thunk.ax>:
      11dd:	8b 04 24                mov    (%esp),%eax
      11e0:	c3                      ret

  Disassembly of section .fini:

  000011e4 <_fini>:
      11e4:	f3 0f 1e fb             endbr32
      11e8:	53                      push   %ebx
      11e9:	83 ec 08                sub    $0x8,%esp
      11ec:	e8 af fe ff ff          call   10a0 <__x86.get_pc_thunk.bx>
      11f1:	81 c3 e7 2d 00 00       add    $0x2de7,%ebx
      11f7:	83 c4 08                add    $0x8,%esp
      11fa:	5b                      pop    %ebx
      11fb:	c3                      ret
#+end_example


操作系统在对地址空间访问是通过分段实现 (segment)
1. 段使用物理上连续的一块空间
2. 分段的历史
   - 8086 是 16 位地址线
   - 当 cpu 升级到 20 位地址线是会出现问题,
   - 为了兼容, 280 芯片启用来段寄存器 cs, ds, ss, es 寄存器
   - 380 芯片又添加了段寄存器 fs, gs
   - 最终导致了实模式下段寻址模式
   #+BEGIN_EXAMPLE
     真实地址 = 段地址 << 4 + address
                 ^             ^
                 |             |
           存储在段寄存器中   偏移
   #+END_EXAMPLE

在 gas 汇编中对段的描述是 section, 例如
#+BEGIN_SRC asm
  .section .text  # 代码段, 可以简写 .text
  .section .data  # 数据段, 可以简写 .data
#+END_SRC

AT&T 寻址方式
#+BEGIN_QUOTE
  section:disp(base, index, scale)
#+END_QUOTE

#+BEGIN_SRC asm
  %es:msg # 寻址 es 段的 msg
#+END_SRC

